InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСНоменклатуройВызовСервераБК/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПараметрыДоступностиСервиса(ПараметрыДоступности) Экспорт 
	 РаботаСНоменклатуройБК.ЗаполнитьПараметрыДоступностиСервиса(ПараметрыДоступности);
КонецПроцедуры

// Выполняет поиск номенклатуры по штрихкоду
//
// Параметры:
//  Штрихкод - Строка - штрихкод.
//
// Возвращаемое значение:
//  СправочникСсылка.Номенклатура
//
Функция НоменклатураПоШтрихкоду(Знач Штрихкод) Экспорт
	
	РезультатПоиска = РегистрыСведений.ШтрихкодыНоменклатуры.НоменклатураПоШтрихкоду(Штрихкод);
	Если РезультатПоиска.Количество() > 0 Тогда
		Результат = РезультатПоиска[0].Номенклатура;
	Иначе
		Результат = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
